## 데이터프레임에 함수 적용하기!

### 데이터 핸들링 실전 연습

In [1]:
import pandas as pd
import numpy as np

In [13]:
df_off = pd.read_csv('../../data/6.세종시_오피스텔(매매)_실거래가.csv')
df_apt= pd.read_csv('../../data/7.세종시_아파트(전월세)_실거래가.csv')

In [3]:
df_off.head()

,계약년월,계약일,시군구,본번,부번,단지명,전용면적(㎡),거래금액(만원),층,건축년도,해제사유발생일
0,201701,4,세종특별자치시 어진동,0,0,푸르지오시티,23.74,"9,000",14,2014,NaN
1,201701,6,세종특별자치시 어진동,0,0,푸르지오시티,23.74,"9,500",11,2014,NaN
2,201702,5,세종특별자치시 나성동,713,0,세진이너스빌,34.15,"13,000",8,2013,NaN
3,201702,7,세종특별자치시 어진동,0,0,푸르지오시티,23.74,"9,500",4,2014,NaN
4,201702,7,세종특별자치시 어진동,0,0,푸르지오시티,23.74,"9,000",4,2014,NaN

In [4]:
df_apt.head()

,계약년월,계약일,시군구,본번,부번,단지명,전월세구분,전용면적(㎡),보증금(만원),월세(만원),층,건축년도
0,201701,13,세종특별자치시 고운동,1396,0,가락마을 20단지(호반베르디움5차),전세,84.9895,"10,000",0,13,2015
1,201701,14,세종특별자치시 고운동,1396,0,가락마을 20단지(호반베르디움5차),전세,84.9895,"18,000",0,19,2015
2,201701,14,세종특별자치시 고운동,1396,0,가락마을 20단지(호반베르디움5차),전세,59.8338,"17,000",0,10,2015
3,201701,15,세종특별자치시 고운동,1396,0,가락마을 20단지(호반베르디움5차),전세,84.9895,"17,000",0,2,2015
4,201702,4,세종특별자치시 고운동,1396,0,가락마을 20단지(호반베르디움5차),월세,84.9895,"10,000",30,13,2015

In [5]:
pd.Series(df_off['전용면적(㎡)'].unique()).isin(pd.Series((df_apt['전용면적(㎡)'].unique())))

0     False
1      True
2     False
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12     True
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42     True
43    False
dtype: bool

In [19]:
df_off = df_off[["계약년월","전용면적(㎡)","거래금액(만원)"]]
df_off.tail()

       계약년월  전용면적(㎡) 거래금액(만원)
340  202012    26.18   16,410
341  202012    24.22    8,600
342  202012    26.18   15,340
343  202012    30.48   11,500
344  202012    44.84   15,600

In [20]:
df_off.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 345 entries, 0 to 344
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   계약년월      345 non-null    int64
 1   전용면적(㎡)   345 non-null    float64
 2   거래금액(만원)  345 non-null    object
dtypes: float64(1), int64(1), object(1)
memory usage: 8.2+ KB

In [24]:
# df_off['거래금액(만원)'] = df_off['거래금액(만원)'].str.replace(",","")
df_off['거래금액(만원)'] = df_off['거래금액(만원)'].str.replace(',', '')
df_off.tail()

       계약년월  전용면적(㎡) 거래금액(만원)
340  202012    26.18    16410
341  202012    24.22     8600
342  202012    26.18    15340
343  202012    30.48    11500
344  202012    44.84    15600

In [26]:
df_off['거래금액(만원)'] = df_off['거래금액(만원)'].astype(int)
df_off.tail()

       계약년월  전용면적(㎡)  거래금액(만원)
340  202012    26.18     16410
341  202012    24.22      8600
342  202012    26.18     15340
343  202012    30.48     11500
344  202012    44.84     15600

In [28]:
df_off = df_off.groupby(['계약년월','전용면적(㎡)']).mean().reset_index()
df_off.tail()

       계약년월  전용면적(㎡)      거래금액(만원)
205  202012    26.18  16053.333333
206  202012    27.43   9500.000000
207  202012    30.48  11500.000000
208  202012    34.15  12000.000000
209  202012    44.84  15600.000000

In [29]:
df_apt = df_apt[df_apt['전월세구분']=='전세']

In [30]:
df_apt.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 26935 entries, 0 to 38893
Data columns (total 12 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   계약년월     26935 non-null  int64
 1   계약일      26935 non-null  int64
 2   시군구      26935 non-null  object
 3   본번       26935 non-null  object
 4   부번       26935 non-null  int64
 5   단지명      26935 non-null  object
 6   전월세구분    26935 non-null  object
 7   전용면적(㎡)  26935 non-null  float64
 8   보증금(만원)  26935 non-null  object
 9   월세(만원)   26935 non-null  int64
 10  층        26935 non-null  int64
 11  건축년도     26935 non-null  int64
dtypes: float64(1), int64(6), object(5)
memory usage: 2.7+ MB

In [31]:
df_apt = df_apt[["계약년월","전용면적(㎡)","보증금(만원)"]]
df_apt

         계약년월   전용면적(㎡) 보증금(만원)
0      201701   84.9895  10,000
1      201701   84.9895  18,000
2      201701   59.8338  17,000
3      201701   84.9895  17,000
5      201702   84.9895  19,000
...       ...       ...     ...
38887  202011  102.8300  35,000
38888  202011   84.9500  30,000
38889  202011   84.9500  34,000
38892  202012   84.9500  30,000
38893  202012   84.9500  34,000

[26935 rows x 3 columns]

In [32]:
df_apt.groupby

<bound method DataFrame.groupby of          계약년월   전용면적(㎡) 보증금(만원)
0      201701   84.9895  10,000
1      201701   84.9895  18,000
2      201701   59.8338  17,000
3      201701   84.9895  17,000
5      201702   84.9895  19,000
...       ...       ...     ...
38887  202011  102.8300  35,000
38888  202011   84.9500  30,000
38889  202011   84.9500  34,000
38892  202012   84.9500  30,000
38893  202012   84.9500  34,000

[26935 rows x 3 columns]>

In [35]:
pd.merge(df_off,df_apt, how="inner", on=["계약년월", "전용면적(㎡)"])

     계약년월  전용면적(㎡)  거래금액(만원) 보증금(만원)
0  202011    24.12    8200.0   8,925
1  202011    24.12    8200.0  10,500
2  202011    24.12    8200.0  10,000

### 3.4.2.행 또는 열 방향으로 주어진 함수를 한 번에 적용 : apply

In [39]:
df_sejong = pd.read_csv('../../data/7.세종시_아파트(전월세)_실거래가.csv')
df_sejong.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38895 entries, 0 to 38894
Data columns (total 12 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   계약년월     38895 non-null  int64
 1   계약일      38895 non-null  int64
 2   시군구      38895 non-null  object
 3   본번       38895 non-null  object
 4   부번       38895 non-null  int64
 5   단지명      38895 non-null  object
 6   전월세구분    38895 non-null  object
 7   전용면적(㎡)  38895 non-null  float64
 8   보증금(만원)  38895 non-null  object
 9   월세(만원)   38895 non-null  int64
 10  층        38895 non-null  int64
 11  건축년도     38895 non-null  int64
dtypes: float64(1), int64(6), object(5)
memory usage: 3.6+ MB

In [41]:
df_sejong[['전용면적(㎡)','보증금(만원)']].tail()

       전용면적(㎡) 보증금(만원)
38890   102.83  10,000
38891   102.53  10,000
38892    84.95  30,000
38893    84.95  34,000
38894    84.95   8,000

In [44]:
df_sejong.loc[0,'전용면적(㎡)'] = 11000
df_sejong.tail()

,계약년월,계약일,시군구,본번,부번,단지명,전월세구분,전용면적(㎡),보증금(만원),월세(만원),층,건축년도
38890,202011,21,세종특별자치시 해밀동,6402,1,해밀마을 2단지,월세,102.83,"10,000",100,5,2020
38891,202012,8,세종특별자치시 해밀동,6402,1,해밀마을 2단지,월세,102.53,"10,000",95,14,2020
38892,202012,11,세종특별자치시 해밀동,6402,1,해밀마을 2단지,전세,84.95,"30,000",0,18,2020
38893,202012,12,세종특별자치시 해밀동,6402,1,해밀마을 2단지,전세,84.95,"34,000",0,18,2020
38894,202012,13,세종특별자치시 해밀동,6402,1,해밀마을 2단지,월세,84.95,"8,000",85,16,2020

In [46]:
df_sejong[['전용면적(㎡)','보증금(만원)']].tail()

       전용면적(㎡) 보증금(만원)
38890   102.83  10,000
38891   102.53  10,000
38892    84.95  30,000
38893    84.95  34,000
38894    84.95   8,000

In [62]:
df_sejong['보증금(만원)'] = df_sejong['보증금(만원)'].str.replace(',', '')
df_sejong['보증금(만원)'] = df_sejong['보증금(만원)'].astype(int)

In [64]:
df_sejong.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38895 entries, 0 to 38894
Data columns (total 12 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   계약년월     38895 non-null  int64
 1   계약일      38895 non-null  int64
 2   시군구      38895 non-null  object
 3   본번       38895 non-null  object
 4   부번       38895 non-null  int64
 5   단지명      38895 non-null  object
 6   전월세구분    38895 non-null  object
 7   전용면적(㎡)  38895 non-null  float64
 8   보증금(만원)  38895 non-null  int32
 9   월세(만원)   38895 non-null  int64
 10  층        38895 non-null  int64
 11  건축년도     38895 non-null  int64
dtypes: float64(1), int32(1), int64(6), object(4)
memory usage: 3.4+ MB

In [65]:
df_sejong[df_sejong['전용면적(㎡)'] < df_sejong['보증금(만원)']]['보증금(만원)']

1        18000
2        17000
3        17000
4        10000
5        19000
         ...
38890    10000
38891    10000
38892    30000
38893    34000
38894     8000
Name: 보증금(만원), Length: 38880, dtype: int32

In [66]:
df_sejong['new_col'] = df_sejong[df_sejong['전용면적(㎡)'] < df_sejong['보증금(만원)']]['보증금(만원)']

In [72]:
non_index = df_sejong[df_sejong['전용면적(㎡)'] >= df_sejong['보증금(만원)']]['보증금(만원)'].index

In [73]:
df_sejong.loc[non_index,'new_col'] = df_sejong[df_sejong['전용면적(㎡)'] >= df_sejong['보증금(만원)']]['전용면적(㎡)']

In [75]:
df_sejong.tail()

,계약년월,계약일,시군구,본번,부번,단지명,전월세구분,전용면적(㎡),보증금(만원),월세(만원),층,건축년도,new_col
38890,202011,21,세종특별자치시 해밀동,6402,1,해밀마을 2단지,월세,102.83,10000,100,5,2020,10000.0
38891,202012,8,세종특별자치시 해밀동,6402,1,해밀마을 2단지,월세,102.53,10000,95,14,2020,10000.0
38892,202012,11,세종특별자치시 해밀동,6402,1,해밀마을 2단지,전세,84.95,30000,0,18,2020,30000.0
38893,202012,12,세종특별자치시 해밀동,6402,1,해밀마을 2단지,전세,84.95,34000,0,18,2020,34000.0
38894,202012,13,세종특별자치시 해밀동,6402,1,해밀마을 2단지,월세,84.95,8000,85,16,2020,8000.0

In [76]:
## 열 방향일때는 그냥 집계함수를 쓰면 되지만 열방향 비교일 때는 apply가 훨씬 편하다 
df_sejong[['전용면적(㎡)','보증금(만원)']].apply(np.max, axis= 1)

0        11000.0
1        18000.0
2        17000.0
3        17000.0
4        10000.0
          ...
38890    10000.0
38891    10000.0
38892    30000.0
38893    34000.0
38894     8000.0
Length: 38895, dtype: float64

### 3.4.3 데이터 내부 각 요소를 처리하는 함수 만들기 
    data['col_name'] = data['col_name'].map(lambda x:x.func(), na_action = 'ignore') 
    
    세부 설명 
    1) lambda는 간단한 함수 개념 
    2) map(lambda)를 사용할 때에는 시리즈 형식이어야 함 . 
    3) map은 원소 접근이어햐 함 (시리즈)  1:1 매핑  대체 원소 -> 원소.func()

In [ ]:
## lambda는 간단한 함수 개념
temp_list = [1,2,3,4,5]
list(map(lambda x : x*10 , temp_list))

In [ ]:
df_sejong['시군구'].str.split(" ",expand=True)[1]

In [ ]:
df_sejong['시군구'].str.split(' ',expand =True)[1]

In [ ]:
df_sejong['시군구'].map(lambda x : x.split(' ')[1] )

In [ ]:
df_sejong['시군구'].map(lambda x : x.split(" ")[1])

In [ ]:
## map(lambda)는 원소 접근이므로 str.split이 아닌, split을 써야함 
## 판다스 접근과는 다르게 문자열 자체에 대한 접근임을 잊으면 안됨!! 
a = "세종특별자치시 고운동"
a.split(" ")

In [ ]:
df_sejong['계약년월']

In [ ]:
df_sejong['계약년월'].astype(str).str[0:4]

In [ ]:
df_sejong['계약년월'].map(lambda x : str(x)[0:4])